Repository: luxeenet/beamAI
Catalog: beamAI/Localizable.xcstrings
Source language: en
Languages: es

source: **Receiving Response from Gemini...**
es: **Recibiendo una respuesta de Gemini**

source: **Reminder: Never share API keys.**
es: **Recordatorio: Nunca compartas claves API.**

source: %lld of %lld questions answered
es: %1$lld de %2$lld preguntas contestadas

source: %lld out of %lld correct
es: %1$lld de %2$lld preguntas correctas

source: %lld Questions
es: %lld Preguntas

source: %lld Selected
es: %lld Seleccionados

source: %lld Stars
es: %lld Estrellas

source: About
es: Acerca de

source: Add New Link
es: Agrega Nuevo Enlace

source: Add up to 5 URLs
es: Agrega hasta 5 URLs

source: AI Model Configurations
es: Configuraciones del Modelo de IA

source: All Quizzes
es: Todos los Cuestionarios

source: API Key Required
es: Clave API Requerida

source: Are you sure you want to clear history?
es: ¿Estás seguro de que quieres borrar el historial?

source: Attachments (%lld)
es: Adjuntos (%lld)

source: Bug Report
es: Informe de Error

source: Buy Me a Coffee
es: Invítame un Café

source: Choose from Library
es: Elegir de la Biblioteca

source: Choose the language for quiz generation.
es: Elige el idioma para la generación del cuestionario.

source: Choose Your Model
es: Elige Tu Modelo

source: Clear
es: Limpiar

source: Clear All
es: Limpiar Todo

source: Click here to answer...
es: Haz clic aquí para responder

source: Content which contains high amounts of harassment, hate speech, sexually explicit, or dangerous content will be blocked.
es: El contenido que contenga altas cantidades de acoso, discurso de odio, contenido sexualmente explícito o peligroso será bloqueado.

source: Continue
es: Continuar

source: Correct
es: Correcto

source: Customize Question Count
es: Personalizar Número de Preguntas

source: Delete
es: Eliminar

source: Developer
es: Desarrollador

source: Done
es: Listo

source: Download Recap Today!
es: ¡Descarga Recap Hoy!

source: Enable Safety Settings
es: Habilitar configuraciones de seguridad

source: Enter a free response
es: Escribe una respuesta libre

source: Enter URL #%lld
es: Ingresa la URL #%lld

source: Enter your Gemini API key
es: Ingresa tu clave API de Gemini

source: Exit Quiz
es: Salir del Cuestionario

source: Expected Answer:
es: Respuesta Esperada

source: Explain
es: Explica

source: Explore
es: Explorar

source: Explore Prompts
es: Explorar Indicaciones

source: Feature Request
es: Solicitud de Función

source: Feedback:
es: Retroalimentación

source: Generating explanation...
es: Generando explicación

source: Generating quiz...
es: Generando cuestionario...

source: Get a free API key from makersuite.google.com.
es: Obtén una clave API gratuita en makersuite.google.com.

source: Get API Key
es: Obtener Clave API

source: Get your free API key from Google AI Studio:
es: Obtén tu clave API gratuita de Google AI Studio:

source: Help me earn the Starstruck badge on GitHub!
es: ¡Ayúdame a ganar la insignia Starstruck en GitHub!

source: History
es: Historial

source: I got a %lld out of %lld on Recap!
es: ¡Obtuve un %lld de %lld en Recap!

source: Input attachments to generate a quiz
es: Ingresa adjuntos para generar un cuestionario

source: Language
es: Idioma

source: Next
es: Siguiente

source: No content filtering will be applied. Note that this may result in inappropriate content being generated.
es: No se aplicará ningún filtro de contenido. Ten en cuenta que esto puede resultar en la generación de contenido inapropiado.

source: No guarantee, but we'll try to get Gemini to generate only ^[%lld question](inflect: true).
es: Sin garantía, pero intentaremos que Gemini genere solo ^[%lld pregunta](inflect: true).

source: Number of Questions: %lld
es: Número de Preguntas: %lld

source: Open Settings
es: Abrir Configuración

source: Paste from Clipboard
es: Pegar desde el Portapapeles

source: Performance Feedback
es: Retroalimentación sobre el rendimiento

source: Personal Gemini API Key
es: Clave de API Personal de Gemini

source: Preferred Model
es: Modelo Preferido

source: Privacy Policy
es: Política de Privacidad

source: Question %lld
es: Pregunta %lld

source: Quiz Settings
es: Configuración del Cuestionario

source: Rate & Review App
es: Calificar y Reseñar la Aplicación

source: Recap AI
es: Recap IA

source: Recap uses Google Gemini to power its AI features
es: Recap utiliza Google Gemini para potenciar sus funciones de IA

source: Regenerate Quiz
es: Regenerar Cuestionario

source: Safety Settings
es: Configuración de Seguridad

source: Scan URLs
es: Escanear URLs

source: Select **multiple** answers
es: **Selecciona **múltiples** respuestas**

source: Select **one** answer
es: Selecciona una respuesta

source: Select which Gemini model you'd like to use
es: Selecciona qué modelo de Gemini te gustaría usar

source: Settings
es: Configuración

source: Share Quiz
es: Compartir Cuestionario

source: Share Results
es: Compartir Resultados

source: Show My Responses
es: Mostrar Mis Respuestas

source: Show Onboarding
es: Mostrar Introducción

source: Skip for now
es: Omitir por ahora

source: Star Repo
es: Destacar Repositorio

source: Submit
es: Enviar

source: Submit Answer
es: Enviar Respuesta

source: Support & Feedback
es: Soporte y Comentarios

source: Support Open Source
es: Apoyar Código Abierto

source: Take Photo
es: Tomar Foto

source: Take Quiz Again
es: Hacer el cuestionario de nuevo

source: Tip: Long press on the `Add New Link` button in order to paste a URL.
es: Consejo: Mantén presionado el botón `Agregar Nuevo Enlace` para pegar una URL.

source: To use Recap, enter your API key!
es: ¡Para usar Recap, ingresa tu clave API!

source: Total Questions
es: Total de Preguntas

source: View Past Results
es: Ver Resultados Anteriores

source: View Source Code
es: Ver Código Fuente

source: We **%@** block potentially harmful content (harassment, hate speech, sexually explicit, dangerous).
es: **%@** bloqueamos contenido potencialmente dañino (acoso, discurso de odio, sexualmente explícito, peligroso).

source: Welcome to Recap AI
es: Bienvenido a Recap IA

source: What would you like a quiz on?
es: ¿Sobre qué te gustaría un cuestionario?

source: Would you like to enable content filtering?
es: ¿Te gustaría habilitar el filtrado de contenido?

source: You got this question correct
es: Respondiste correctamente a esta pregunta

source: You got this question correct!
es: ¡Respondiste correctamente a esta pregunta!

source: You got this question incorrect
es: Respondiste incorrectamente a esta pregunta

source: You got this question incorrect.
es: Respondiste incorrectamente a esta pregunta.

source: Your Answer:
es: Tu respuesta:

source: Your star helps in many ways:
es: Tu estrella ayuda de muchas maneras:
